lpodkalicki/blog/avr/asm/include/ATxmega64A3Udef.inc
.equ TCD1_CTRLA = 2368		// Control  Register A
.equ TCD1_CTRLB = 2369		// Control Register B
.equ TCD1_CTRLC = 2370		// Control register C
.equ TCD1_CTRLD = 2371		// Control Register D
.equ TCD1_CTRLE = 2372		// Control Register E
.equ TCD1_INTCTRLA = 2374		// Interrupt Control Register A
.equ TCD1_INTCTRLB = 2375		// Interrupt Control Register B
.equ TCD1_CTRLFCLR = 2376		// Control Register F Clear
.equ TCD1_CTRLFSET = 2377		// Control Register F Set
.equ TCD1_CTRLGCLR = 2378		// Control Register G Clear
.equ TCD1_CTRLGSET = 2379		// Control Register G Set
.equ TCD1_INTFLAGS = 2380		// Interrupt Flag Register
.equ TCD1_TEMP = 2383		// Temporary Register For 16-bit Access
.equ TCD1_CNT = 2400		// Count
.equ TCD1_PER = 2406		// Period
.equ TCD1_CCA = 2408		// Compare or Capture A
.equ TCD1_CCB = 2410		// Compare or Capture B
.equ TCD1_PERBUF = 2422		// Period Buffer
.equ TCD1_CCABUF = 2424		// Compare Or Capture A Buffer
.equ TCD1_CCBBUF = 2426		// Compare Or Capture B Buffer

;***************************************************************************
;** HIRESD - High-Resolution Extension D
;***************************************************************************
	
.equ HIRESD_CTRLA = 2448		// Control Register

;***************************************************************************
;** USARTD0 - Universal Asynchronous Receiver-Transmitter D0
;***************************************************************************
	
.equ USARTD0_DATA = 2464		// Data Register
.equ USARTD0_STATUS = 2465		// Status Register
.equ USARTD0_CTRLA = 2467		// Control Register A
.equ USARTD0_CTRLB = 2468		// Control Register B
.equ USARTD0_CTRLC = 2469		// Control Register C
.equ USARTD0_BAUDCTRLA = 2470		// Baud Rate Control Register A
.equ USARTD0_BAUDCTRLB = 2471		// Baud Rate Control Register B

;***************************************************************************
;** USARTD1 - Universal Asynchronous Receiver-Transmitter D1
;***************************************************************************
	
.equ USARTD1_DATA = 2480		// Data Register
.equ USARTD1_STATUS = 2481		// Status Register
.equ USARTD1_CTRLA = 2483		// Control Register A
.equ USARTD1_CTRLB = 2484		// Control Register B
.equ USARTD1_CTRLC = 2485		// Control Register C
.equ USARTD1_BAUDCTRLA = 2486		// Baud Rate Control Register A
.equ USARTD1_BAUDCTRLB = 2487		// Baud Rate Control Register B

;***************************************************************************
;** SPID - Serial Peripheral Interface D
;***************************************************************************
	
.equ SPID_CTRL = 2496		// Control Register
.equ SPID_INTCTRL = 2497		// Interrupt Control Register
.equ SPID_STATUS = 2498		// Status Register
.equ SPID_DATA = 2499		// Data Register

;***************************************************************************
;** TCE0 - Timer/Counter E0
;***************************************************************************
	
.equ TCE0_CTRLA = 2560		// Control  Register A
.equ TCE0_CTRLB = 2561		// Control Register B
.equ TCE0_CTRLC = 2562		// Control register C
.equ TCE0_CTRLD = 2563		// Control Register D
.equ TCE0_CTRLE = 2564		// Control Register E
.equ TCE0_INTCTRLA = 2566		// Interrupt Control Register A
.equ TCE0_INTCTRLB = 2567		// Interrupt Control Register B
.equ TCE0_CTRLFCLR = 2568		// Control Register F Clear
.equ TCE0_CTRLFSET = 2569		// Control Register F Set
.equ TCE0_CTRLGCLR = 2570		// Control Register G Clear
.equ TCE0_CTRLGSET = 2571		// Control Register G Set
.equ TCE0_INTFLAGS = 2572		// Interrupt Flag Register
.equ TCE0_TEMP = 2575		// Temporary Register For 16-bit Access
.equ TCE0_CNT = 2592		// Count
.equ TCE0_PER = 2598		// Period
.equ TCE0_CCA = 2600		// Compare or Capture A
.equ TCE0_CCB = 2602		// Compare or Capture B
.equ TCE0_CCC = 2604		// Compare or Capture C
.equ TCE0_CCD = 2606		// Compare or Capture D
.equ TCE0_PERBUF = 2614		// Period Buffer
.equ TCE0_CCABUF = 2616		// Compare Or Capture A Buffer
.equ TCE0_CCBBUF = 2618		// Compare Or Capture B Buffer
.equ TCE0_CCCBUF = 2620		// Compare Or Capture C Buffer
.equ TCE0_CCDBUF = 2622		// Compare Or Capture D Buffer

;***************************************************************************
;** TCE1 - Timer/Counter E1
;***************************************************************************
	
.equ TCE1_CTRLA = 2624		// Control  Register A
.equ TCE1_CTRLB = 2625		// Control Register B
.equ TCE1_CTRLC = 2626		// Control register C
.equ TCE1_CTRLD = 2627		// Control Register D
.equ TCE1_CTRLE = 2628		// Control Register E
.equ TCE1_INTCTRLA = 2630		// Interrupt Control Register A
.equ TCE1_INTCTRLB = 2631		// Interrupt Control Register B
.equ TCE1_CTRLFCLR = 2632		// Control Register F Clear
.equ TCE1_CTRLFSET = 2633		// Control Register F Set
.equ TCE1_CTRLGCLR = 2634		// Control Register G Clear
.equ TCE1_CTRLGSET = 2635		// Control Register G Set
.equ TCE1_INTFLAGS = 2636		// Interrupt Flag Register
.equ TCE1_TEMP = 2639		// Temporary Register For 16-bit Access
.equ TCE1_CNT = 2656		// Count
.equ TCE1_PER = 2662		// Period
.equ TCE1_CCA = 2664		// Compare or Capture A
.equ TCE1_CCB = 2666		// Compare or Capture B
.equ TCE1_PERBUF = 2678		// Period Buffer
.equ TCE1_CCABUF = 2680		// Compare Or Capture A Buffer
.equ TCE1_CCBBUF = 2682		// Compare Or Capture B Buffer

;***************************************************************************
;** AWEXE - Advanced Waveform Extension E
;***************************************************************************
	
.equ AWEXE_CTRL = 2688		// Control Register
.equ AWEXE_FDEMASK = 2690		// Fault Detection Event Mask
.equ AWEXE_FDCTRL = 2691		// Fault Detection Control Register
.equ AWEXE_STATUS = 2692		// Status Register
.equ AWEXE_STATUSSET = 2693		// Status Set Register
.equ AWEXE_DTBOTH = 2694		// Dead Time Both Sides
.equ AWEXE_DTBOTHBUF = 2695		// Dead Time Both Sides Buffer
.equ AWEXE_DTLS = 2696		// Dead Time Low Side
.equ AWEXE_DTHS = 2697		// Dead Time High Side
.equ AWEXE_DTLSBUF = 2698		// Dead Time Low Side Buffer
.equ AWEXE_DTHSBUF = 2699		// Dead Time High Side Buffer
.equ AWEXE_OUTOVEN = 2700		// Output Override Enable

;***************************************************************************
;** HIRESE - High-Resolution Extension E
;***************************************************************************
	
